<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Seeder;

class ServiceSeeder extends Seeder
{
    public function run(): void
    {

        $dataService = [
            [
                'id' => 1,
                'name' => 'ពិនិត្យសុខភាពទូទៅ',
                'service_type' => 1,
                'local_name' => 'ពិនិត្យសុខភាពទូទៅ',
                'description' => 'ការពិនិត្យសុខភាពប្រចាំឆ្នាំគឺជាវិធីល្អបំផុតមួយដើម្បីការពារសុខភាពរបស់អ្នក។ របៀបរស់នៅដែលមានសុខភាពល្អមានន័យថា ការជ្រើសរើសត្រឹមត្រូវក្នុងរបបអាហារ និងការហាត់ប្រាណ ព្រមទាំងមានការត្រួតពិនិត្យសុខភាពជាទៀងទាត់ ដើម្បីធានាថារាងកាយរបស់អ្នកដើរលើផ្លូវត្រូវ និងដើម្បីកំណត់បញ្ហា ឬបញ្ហាសុខភាពដែលកំពុងកើតមាន។ ជាមួយនឹងការរកឃើញជំងឺ ឬលក្ខខណ្ឌទាន់ពេលវេលា ជំងឺជាច្រើនអាចត្រូវបានព្យាបាល មុនពេលដែលវាបង្កបញ្ហាធ្ងន់ធ្ងរដល់សុខភាពរបស់អ្នក។',
                'local_description' => 'ការពិនិត្យសុខភាពប្រចាំឆ្នាំគឺជាវិធីល្អបំផុតមួយដើម្បីការពារសុខភាពរបស់អ្នក។ របៀបរស់នៅដែលមានសុខភាពល្អមានន័យថា ការជ្រើសរើសត្រឹមត្រូវក្នុងរបបអាហារ និងការហាត់ប្រាណ ព្រមទាំងមានការត្រួតពិនិត្យសុខភាពជាទៀងទាត់ ដើម្បីធានាថារាងកាយរបស់អ្នកដើរលើផ្លូវត្រូវ និងដើម្បីកំណត់បញ្ហា ឬបញ្ហាសុខភាពដែលកំពុងកើតមាន។ ជាមួយនឹងការរកឃើញជំងឺ ឬលក្ខខណ្ឌទាន់ពេលវេលា ជំងឺជាច្រើនអាចត្រូវបានព្យាបាល មុនពេលដែលវាបង្កបញ្ហាធ្ងន់ធ្ងរដល់សុខភាពរបស់អ្នក។',
            ],
            [
                'id' => 2,
                'name' => 'កញ្ចប់ពិនិត្យសុខភាពគ្រប់គ្រងជំងឺរ៉ាំរ៉ៃ',
                'service_type' => 1,
                'local_name' => 'កញ្ចប់ពិនិត្យសុខភាពគ្រប់គ្រងជំងឺរ៉ាំរ៉ៃ',
                'description' => 'កញ្ចប់គ្រប់គ្រងជំងឺរ៉ាំរ៉ៃរបស់យើងជួយបុគ្គលម្នាក់ៗតាមដាន និងគ្រប់គ្រងស្ថានភាពដូចជា លើសសម្ពាធឈាម ទឹកនោមផ្អែម ជំងឺបេះដូង និងបញ្ហាតម្រងនោម។ កញ្ចប់នេះផ្តោតលើការវាយតម្លៃសុខភាពជាប្រចាំ ការរកឃើញដំបូង និងយុទ្ធសាស្ត្រគ្រប់គ្រងផ្ទាល់ខ្លួន ដែលធ្វើឱ្យវាល្អសម្រាប់អ្នកដែលមានលក្ខខណ្ឌដែលមានស្រាប់ ឬបុគ្គលដែលមានហានិភ័យ។.',
                'local_description' => 'កញ្ចប់គ្រប់គ្រងជំងឺរ៉ាំរ៉ៃរបស់យើងជួយបុគ្គលម្នាក់ៗតាមដាន និងគ្រប់គ្រងស្ថានភាពដូចជា លើសសម្ពាធឈាម ទឹកនោមផ្អែម ជំងឺបេះដូង និងបញ្ហាតម្រងនោម។ កញ្ចប់នេះផ្តោតលើការវាយតម្លៃសុខភាពជាប្រចាំ ការរកឃើញដំបូង និងយុទ្ធសាស្ត្រគ្រប់គ្រងផ្ទាល់ខ្លួន ដែលធ្វើឱ្យវាល្អសម្រាប់អ្នកដែលមានលក្ខខណ្ឌដែលមានស្រាប់ ឬបុគ្គលដែលមានហានិភ័យ។.',
            ],
            [
                'id' => 3,
                'name' => 'កញ្ចប់ពិនិត្យមហារីក-Cancer Screening Packages',
                'service_type' => 1,
                'local_name' => 'កញ្ចប់ពិនិត្យមហារីក-Cancer Screening Packages',
                'description' => 'កញ្ចប់ពិនិត្យជំងឺមហារីករបស់យើងត្រូវបានរចនាឡើងដើម្បីកំណត់សញ្ញាព្រមាននៃជំងឺមហារីកទូទៅនៅដំណាក់កាលដំបូងដែលអាចព្យាបាលបានច្រើនជាងមុន។ កញ្ចប់ទាំងនេះត្រូវបានកែសម្រួលតាមអាយុ ភេទ និងកត្តាហានិភ័យបុគ្គល ហើយត្រូវបានអនុវត្តដោយអ្នកជំនាញវេជ្ជសាស្រ្តដែលមានបទពិសោធន៍ជាមួយនឹងឧបករណ៍វិនិច្ឆ័យទំនើប។',
                'local_description' => 'កញ្ចប់ពិនិត្យជំងឺមហារីករបស់យើងត្រូវបានរចនាឡើងដើម្បីកំណត់សញ្ញាព្រមាននៃជំងឺមហារីកទូទៅនៅដំណាក់កាលដំបូងដែលអាចព្យាបាលបានច្រើនជាងមុន។ កញ្ចប់ទាំងនេះត្រូវបានកែសម្រួលតាមអាយុ ភេទ និងកត្តាហានិភ័យបុគ្គល ហើយត្រូវបានអនុវត្តដោយអ្នកជំនាញវេជ្ជសាស្រ្តដែលមានបទពិសោធន៍ជាមួយនឹងឧបករណ៍វិនិច្ឆ័យទំនើប។',
            ],
            [
                'id' => 4,
                'name' => 'កញ្ចប់វ៉ាក់សាំងមនុស្សពេញវ័យ',
                'service_type' => 2,
                'local_name' => 'កញ្ចប់វ៉ាក់សាំងមនុស្សពេញវ័យ',
                'description' => 'បន្តការពារពីជំងឺដែលអាចការពារបាន និងលើកកម្ពស់សុខភាពរយៈពេលវែងរបស់អ្នកជាមួយនឹងកញ្ចប់វ៉ាក់សាំងមនុស្សពេញវ័យដែលបានរៀបចំយ៉ាងប្រុងប្រយ័ត្នរបស់យើង។ មិនថាអ្នកកំពុងធ្វើបច្ចុប្បន្នភាពការចាក់ថ្នាំបង្ការរបស់អ្នក ធ្វើដំណើរទៅក្រៅប្រទេស ឬគ្រប់គ្រងស្ថានភាពរ៉ាំរ៉ៃនោះទេ យើងមានកញ្ចប់មួយដែលតម្រូវសម្រាប់អ្នក។',
                'local_description' => 'បន្តការពារពីជំងឺដែលអាចការពារបាន និងលើកកម្ពស់សុខភាពរយៈពេលវែងរបស់អ្នកជាមួយនឹងកញ្ចប់វ៉ាក់សាំងមនុស្សពេញវ័យដែលបានរៀបចំយ៉ាងប្រុងប្រយ័ត្នរបស់យើង។ មិនថាអ្នកកំពុងធ្វើបច្ចុប្បន្នភាពការចាក់ថ្នាំបង្ការរបស់អ្នក ធ្វើដំណើរទៅក្រៅប្រទេស ឬគ្រប់គ្រងស្ថានភាពរ៉ាំរ៉ៃនោះទេ យើងមានកញ្ចប់មួយដែលតម្រូវសម្រាប់អ្នក។',
            ],
            [
                'id' => 5,
                'name' => 'កញ្ចប់ថ្នាំបង្ការទារក',
                'local_name' => 'កញ្ចប់ថ្នាំបង្ការទារក',
                'service_type' => 2,
                'description' => 'ផ្តល់ឱ្យកូនរបស់អ្នកនូវការចាប់ផ្តើមដ៏ល្អបំផុតក្នុងជីវិត ដោយការពារពួកគេពីជំងឺធ្ងន់ធ្ងរក្នុងកុមារ តាមរយៈការចាក់ថ្នាំបង្ការទាន់ពេលវេលា។ កញ្ចប់វ៉ាក់សាំងរបស់យើងត្រូវបានរចនាឡើងដើម្បីបំពេញតម្រូវការរបស់គ្រួសារគ្រប់រូប—ចាប់ពីវ៉ាក់សាំងសំខាន់ៗរបស់រដ្ឋាភិបាលរហូតដល់ការបញ្ចប់ផែនការការពារឯកជន។ វ៉ាក់សាំងទាំងអស់ត្រូវបានគ្រប់គ្រងដោយគ្រូពេទ្យកុមារ និងគិលានុបដ្ឋាយិកាដែលមានអាជ្ញាប័ណ្ណក្នុងបរិយាកាសស្អាត និងងាយស្រួលសម្រាប់ទារក។',
                'local_description' => 'ផ្តល់ឱ្យកូនរបស់អ្នកនូវការចាប់ផ្តើមដ៏ល្អបំផុតក្នុងជីវិត ដោយការពារពួកគេពីជំងឺធ្ងន់ធ្ងរក្នុងកុមារ តាមរយៈការចាក់ថ្នាំបង្ការទាន់ពេលវេលា។ កញ្ចប់វ៉ាក់សាំងរបស់យើងត្រូវបានរចនាឡើងដើម្បីបំពេញតម្រូវការរបស់គ្រួសារគ្រប់រូប—ចាប់ពីវ៉ាក់សាំងសំខាន់ៗរបស់រដ្ឋាភិបាលរហូតដល់ការបញ្ចប់ផែនការការពារឯកជន។ វ៉ាក់សាំងទាំងអស់ត្រូវបានគ្រប់គ្រងដោយគ្រូពេទ្យកុមារ និងគិលានុបដ្ឋាយិកាដែលមានអាជ្ញាប័ណ្ណក្នុងបរិយាកាសស្អាត និងងាយស្រួលសម្រាប់ទារក។',
            ],
        ];

        foreach ($dataService as $data) {
            $services = new Service();
            $services->id = $data['id'];
            $services->name = $data['name'];
            $services->local_name = $data['local_name'];
            $services->description = $data['description'];
            $services->local_description = $data['local_description'];
            $services->service_type = $data['service_type'];
            $services->save();
        }

    }
}
